; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	image0 - mode
	image3 - mode
	infrared2 - mode
	image1 - mode
	GroundStation4 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star0 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
	Planet21 - direction
	Phenomenon22 - direction
	Phenomenon23 - direction
	Planet24 - direction
	Phenomenon25 - direction
	Planet26 - direction
	Planet27 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image0)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 image1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument4 image0)
	(supports instrument4 image3)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
	(supports instrument5 infrared2)
	(supports instrument5 image3)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet21)
	(supports instrument6 image1)
	(calibration_target instrument6 Star0)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet20)
)
(:goal (and
	(pointing satellite0 Planet19)
	(pointing satellite3 Phenomenon14)
	(have_image Phenomenon5 image3)
	(have_image Star7 infrared2)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon9 image1)
	(have_image Star11 image1)
	(have_image Star12 infrared2)
	(have_image Planet13 image3)
	(have_image Phenomenon14 image3)
	(have_image Phenomenon15 image1)
	(have_image Planet16 image0)
	(have_image Phenomenon17 infrared2)
	(have_image Planet18 image3)
	(have_image Planet19 infrared2)
	(have_image Planet20 image0)
	(have_image Planet21 image0)
	(have_image Phenomenon22 image1)
	(have_image Phenomenon23 infrared2)
	(have_image Planet24 image0)
	(have_image Phenomenon25 image1)
	(have_image Planet26 image1)
	(have_image Planet27 image3)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 23
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 23
3. (turn_to satellite4 phenomenon15 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 phenomenon15)
   goals met: 0 of 23
4. (turn_to satellite4 star0 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 star0)
   goals met: 0 of 23
5. (calibrate satellite4 instrument6 star0)
   added: (calibrated instrument6)
   goals met: 0 of 23
6. (turn_to satellite4 phenomenon15 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon15)
   goals met: 0 of 23
7. (take_image satellite4 phenomenon15 instrument6 image1)
   added: (have_image phenomenon15 image1)
   goals met: 1 of 23
8. (turn_to satellite4 phenomenon22 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon22)
   goals met: 1 of 23
9. (take_image satellite4 phenomenon22 instrument6 image1)
   added: (have_image phenomenon22 image1)
   goals met: 2 of 23
10. (turn_to satellite4 phenomenon25 phenomenon22)
   deleted: (pointing satellite4 phenomenon22)
   added: (pointing satellite4 phenomenon25)
   goals met: 2 of 23
11. (take_image satellite4 phenomenon25 instrument6 image1)
   added: (have_image phenomenon25 image1)
   goals met: 3 of 23
12. (turn_to satellite4 phenomenon8 phenomenon25)
   deleted: (pointing satellite4 phenomenon25)
   added: (pointing satellite4 phenomenon8)
   goals met: 3 of 23
13. (take_image satellite4 phenomenon8 instrument6 image1)
   added: (have_image phenomenon8 image1)
   goals met: 4 of 23
14. (turn_to satellite4 phenomenon9 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 phenomenon9)
   goals met: 4 of 23
15. (take_image satellite4 phenomenon9 instrument6 image1)
   added: (have_image phenomenon9 image1)
   goals met: 5 of 23
16. (turn_to satellite4 planet26 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet26)
   goals met: 5 of 23
17. (take_image satellite4 planet26 instrument6 image1)
   added: (have_image planet26 image1)
   goals met: 6 of 23
18. (turn_to satellite4 star11 planet26)
   deleted: (pointing satellite4 planet26)
   added: (pointing satellite4 star11)
   goals met: 6 of 23
19. (take_image satellite4 star11 instrument6 image1)
   added: (have_image star11 image1)
   goals met: 7 of 23
20. (turn_to satellite3 groundstation1 planet21)
   deleted: (pointing satellite3 planet21)
   added: (pointing satellite3 groundstation1)
   goals met: 7 of 23
21. (calibrate satellite3 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 7 of 23
22. (turn_to satellite3 phenomenon14 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon14)
   goals met: 8 of 23
23. (take_image satellite3 phenomenon14 instrument5 image3)
   added: (have_image phenomenon14 image3)
   goals met: 9 of 23
24. (turn_to satellite0 planet19 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet19)
   goals met: 10 of 23
25. (turn_to satellite3 phenomenon17 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon17)
   goals met: 9 of 23
26. (take_image satellite3 phenomenon17 instrument5 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 10 of 23
27. (turn_to satellite3 phenomenon14 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 phenomenon14)
   goals met: 11 of 23
28. (turn_to satellite3 phenomenon23 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon23)
   goals met: 10 of 23
29. (take_image satellite3 phenomenon23 instrument5 infrared2)
   added: (have_image phenomenon23 infrared2)
   goals met: 11 of 23
30. (turn_to satellite3 phenomenon14 phenomenon23)
   deleted: (pointing satellite3 phenomenon23)
   added: (pointing satellite3 phenomenon14)
   goals met: 12 of 23
31. (turn_to satellite3 phenomenon5 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon5)
   goals met: 11 of 23
32. (take_image satellite3 phenomenon5 instrument5 image3)
   added: (have_image phenomenon5 image3)
   goals met: 12 of 23
33. (turn_to satellite3 phenomenon14 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 phenomenon14)
   goals met: 13 of 23
34. (turn_to satellite3 planet13 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet13)
   goals met: 12 of 23
35. (take_image satellite3 planet13 instrument5 image3)
   added: (have_image planet13 image3)
   goals met: 13 of 23
36. (turn_to satellite3 phenomenon14 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 phenomenon14)
   goals met: 14 of 23
37. (turn_to satellite3 planet16 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet16)
   goals met: 13 of 23
38. (take_image satellite3 planet16 instrument5 image0)
   added: (have_image planet16 image0)
   goals met: 14 of 23
39. (turn_to satellite3 phenomenon14 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 phenomenon14)
   goals met: 15 of 23
40. (turn_to satellite3 planet18 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet18)
   goals met: 14 of 23
41. (take_image satellite3 planet18 instrument5 image3)
   added: (have_image planet18 image3)
   goals met: 15 of 23
42. (turn_to satellite3 phenomenon14 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 phenomenon14)
   goals met: 16 of 23
43. (turn_to satellite3 planet19 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet19)
   goals met: 15 of 23
44. (take_image satellite3 planet19 instrument5 infrared2)
   added: (have_image planet19 infrared2)
   goals met: 16 of 23
45. (turn_to satellite3 phenomenon14 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 phenomenon14)
   goals met: 17 of 23
46. (turn_to satellite3 planet20 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet20)
   goals met: 16 of 23
47. (take_image satellite3 planet20 instrument5 image0)
   added: (have_image planet20 image0)
   goals met: 17 of 23
48. (turn_to satellite3 phenomenon14 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 phenomenon14)
   goals met: 18 of 23
49. (turn_to satellite3 planet21 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet21)
   goals met: 17 of 23
50. (take_image satellite3 planet21 instrument5 image0)
   added: (have_image planet21 image0)
   goals met: 18 of 23
51. (turn_to satellite3 phenomenon14 planet21)
   deleted: (pointing satellite3 planet21)
   added: (pointing satellite3 phenomenon14)
   goals met: 19 of 23
52. (turn_to satellite3 planet24 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet24)
   goals met: 18 of 23
53. (take_image satellite3 planet24 instrument5 image0)
   added: (have_image planet24 image0)
   goals met: 19 of 23
54. (turn_to satellite3 phenomenon14 planet24)
   deleted: (pointing satellite3 planet24)
   added: (pointing satellite3 phenomenon14)
   goals met: 20 of 23
55. (turn_to satellite3 planet27 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet27)
   goals met: 19 of 23
56. (take_image satellite3 planet27 instrument5 image3)
   added: (have_image planet27 image3)
   goals met: 20 of 23
57. (turn_to satellite3 phenomenon14 planet27)
   deleted: (pointing satellite3 planet27)
   added: (pointing satellite3 phenomenon14)
   goals met: 21 of 23
58. (turn_to satellite3 star12 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star12)
   goals met: 20 of 23
59. (take_image satellite3 star12 instrument5 infrared2)
   added: (have_image star12 infrared2)
   goals met: 21 of 23
60. (turn_to satellite3 phenomenon14 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 phenomenon14)
   goals met: 22 of 23
61. (turn_to satellite3 star7 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star7)
   goals met: 21 of 23
62. (take_image satellite3 star7 instrument5 infrared2)
   added: (have_image star7 infrared2)
   goals met: 22 of 23
63. (turn_to satellite3 phenomenon14 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 phenomenon14)
   goals met: 23 of 23
